/*********************************************************************************
*团队：5G-037
*作者：xsfan
*说明：CA-SCL算法主要程序
*********************************************************************************/

/************************************头文件**************************************/
#include "polar_scl.h"
#include "polar_ca_scl.h"

/*********************************************************************************
*功能：计算L条译码序列，通过CRC则输出为最终译码序列
*参数：无
*返回值：CRC校验结果，通过为0，不通过为1
*********************************************************************************/
int ca_scl()
{
	int i;
	int crcResult;
	scl();													//调用SCL算法函数，求L条译码路径

	for(i=0;i<searchList;i++)								//按PM值从大到小顺序进行CRC校验
	{
		ExtractInfo(out[sortInfo[i]]);						//提取信息位
		crcResult = CrcCheck();								//CRC校验
		if(crcResult == 0)									//若通过CRC校验
		{
			memcpy(decode,out[sortInfo[i]],sizeof(out[0]));	//此译码序列作为输出，退出循环
			break;
		}
	}

	return crcResult;										//返回校验结果
}

/*********************************************************************************
*功能：CA-SCL算法，根据CRC校验结果决定最终译码序列
*参数：无
*返回值：译码结果
*********************************************************************************/
void Polar_ca_scl()
{
	int crcResult;
	crcResult = ca_scl();
	if(crcResult)											//无通过CRC序列
	{
		memcpy(decode,out[sortInfo[0]],sizeof(out[0]));		//PM值最大的序列为输出
	}
}

