/*********************************************************************************
*团队：5G-037
*作者：xsfan
*说明：aCA-SCL算法主要程序
*********************************************************************************/

/************************************头文件**************************************/
#include "polar_scl.h"
#include "polar_ca_scl.h"
#include "polar_aca_scl.h"

/***********************************变量定义*************************************/
int acaLength;													//aCA最大搜索宽度

/*********************************************************************************
*功能：aCA-SCL算法
*参数：无
*返回值：译码结果
*********************************************************************************/
void Polar_aca_scl()
{
	int fandStatus;

	searchList = 1;												//初始搜索宽度
	while(searchList <= acaLength)								//未达到搜索宽度上限
	{
		fandStatus = ca_scl();									//是否找到通过CRC的译码序列
		if(fandStatus == 0)
		{
			break;												//找到则退出
		}
		else												
		{
			if(searchList == acaLength)
			{
				memcpy(decode,out[sortInfo[0]],sizeof(out[0]));	//达到搜索上限则PM值最大序列做译码结果
				break;
			}
			searchList = searchList*2;							//未达到搜索上限则L扩大两倍继续搜索
		}
	}
}